//24.Вывести на экран таблицу квадратов чисел от 1 до N

int N=10;
for(int i=1;i<=N;i++)
System.Console.WriteLine($"{i}^2={i*i}");

