//30.Написать программу вычисления произведения чисел от 1 до N

int N=10;
for(int i=1;i<=N;i++)
System.Console.WriteLine($"{i,4}{i*i,10}");
